<div style="text-align: center"> <h1>Assignment 22</h1></div>

<h2 style='text-align: left;'> Assignment Questions </h2>

<h3 style='text-align: left;'> 1.  Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series. </h3>

In [2]:
import pandas as pd

In [7]:
s = pd.Series((4,8,15,16,23,42))

In [8]:
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<h3 style='text-align: left;'> 2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it. </h3>

In [11]:
l = [1,2,3,4,5,6,7,8,9,10]

In [13]:
s1 = pd.Series(l)

In [14]:
print(s1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<h3 style='text-align: left;'> 3. Create a Pandas DataFrame that contains the following data: </h3>

<table border="1">
    <tr>
        <td>Name</td>
        <td>Age</td>
        <td>Gender</td>
    </tr>
    <tr>
        <td>Alice</td>
        <td>25</td>
        <td>Female</td>
    </tr>
    <tr>
        <td>Bob</td>
        <td>30</td>
        <td>Male</td>
    </tr>
     <tr>
        <td>Claire</td>
        <td>27</td>
        <td>Female</td>
    </tr>
</table>
<h3> Then, print the DataFrame </h3>

In [38]:
df = pd.DataFrame([["Alice",25 , "Female"], ["Bob",30,"Male"], ["Claire", 27, "Female"]], columns = ["Name", "Age", "Gender"]) 
# we specify value for rows

In [39]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [35]:
data = {"Name" : ['Alice', 'Bob', 'Claire'], "Age" : [25,30,27], "Gender" : ["Female", "Male", "Feamle"]}
# we specify value for each columns

In [36]:
df1 = pd.DataFrame(data)

In [37]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Feamle

<h3 style='text-align: left;'> 4.  What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example. </h3>

<p> <b> Ans:- </b> <br><br> In the context of the Python library pandas, a `DataFrame` is a two-dimensional tabular data structure that can store and manipulate data in a structured and organized manner. It is similar to a table in a relational database or an Excel spreadsheet. Each column in a `DataFrame` can hold data of different types, such as integers, floats, strings, etc. It provides powerful tools for data manipulation, analysis, and cleaning.

On the other hand, a `Series` is a one-dimensional array-like data structure in pandas. It can be thought of as a single column from a `DataFrame`. A `Series` holds an array of data along with an associated array of data labels, which are referred to as the index.


In this example, `df` is a `DataFrame` with three columns: 'Name', 'Age', and 'City'. Each column is a `Series` containing the respective data. The `ages` variable is a standalone `Series` containing the ages of individuals.

Key differences:
1. `DataFrame` is a two-dimensional structure with rows and columns, while `Series` is a one-dimensional array with an index.
2. `DataFrame` can hold multiple columns of data, each potentially of a different type, while `Series` is designed to hold a single column of data of the same type.
3. `DataFrame` provides more functionalities for data manipulation across multiple columns, while `Series` is more suited for working with a single column of data.

In summary, `DataFrame` is a more comprehensive structure for handling structured data, while `Series` is used for working with a single column of data. <br>  </p>

In [40]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 28],
        'City': ['New York', 'London', 'San Francisco']}

df = pd.DataFrame(data)

# Creating a Series
ages = pd.Series([25, 30, 28], name='Age')

print("DataFrame:")
print(df)
print("\nSeries:")
print(ages)

DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30         London
2  Charlie   28  San Francisco

Series:
0    25
1    30
2    28
Name: Age, dtype: int64

<h3 style='text-align: left;'> 5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions? </h3>

<p>  <b> Ans:- </b> <br><br> 

Pandas provides a wide range of functions for manipulating data in a DataFrame. Here are some common functions along with examples of when you might use them:

1. **Selection and Indexing:**
   - `df[column]`: Access a specific column.
   - `df.loc[row_label, column_label]`: Access a specific cell by label.
   - `df.iloc[row_index, column_index]`: Access a specific cell by index.

2. **Filtering and Querying:**
   - `df[df['column'] > value]`: Filter rows based on a condition.
   - `df.query('condition')`: Query DataFrame using a string-based expression.

3. **Grouping and Aggregation:**
   - `df.groupby('column').agg_function()`: Group data by a column and apply an aggregation function.

4. **Sorting:**
   - `df.sort_values('column')`: Sort DataFrame by a column.
   - `df.sort_index()`: Sort DataFrame by index.
   
5. **Joining and Merging:**
   - `pd.merge(df1, df2, on='key')`: Merge two DataFrames on a common key.

6. **Adding and Dropping Columns:**
   - `df['new_column'] = value`: Add a new column.
   - `df.drop('column', axis=1)`: Drop a column.

7. **Handling Missing Data:**
   - `df.dropna()`: Drop rows with missing values.
   - `df.fillna(value)`: Fill missing values with a specified value.

These are just a few examples of the many functions that Pandas provides for data manipulation. The specific functions you use will depend on your data analysis tasks and goals.
    
</p>

In [67]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 28]}
df = pd.DataFrame(data)

print(df['Name'])  # Access the 'Name' column
print(df.loc[0, 'Age'])  # Access the cell in the first row and 'Age' column

df

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
25

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [69]:
adults = df[df['Age'] > 25]  # Filter rows where Age is greater than 25
charlies = df.query("Name == 'Charlie'")  # Query rows with Name equal to 'Charlie'

adults
charlies

      Name  Age
2  Charlie   28

In [70]:
grouped = df.groupby('Age')['Name'].count()  # Count occurrences of each age
grouped

Age
25    1
28    1
30    1
Name: Name, dtype: int64

In [71]:
sorted_df = df.sort_values('Age', ascending=False)  # Sort by 'Age' in descending order
sorted_df

      Name  Age
1      Bob   30
2  Charlie   28
0    Alice   25

In [77]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Value1': [10, 20, 30]})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Value2': [15, 25, 35]})
merged = pd.merge(df1, df2, on='ID')  # Merge based on 'ID' column
df1

   ID  Value1
0   1      10
1   2      20
2   3      30

In [80]:
df2

   ID  Value2
0   2      15
1   3      25
2   4      35

In [86]:
merged

   ID  Value1  Value2
0   2      20      15
1   3      30      25

<h3 style='text-align: left;'> 6. Which of the following is mutable in nature Series, DataFrame, Panel? </h3>

<p> <b> Ans:- </b> <br><br> In pandas, among the options you provided, both `Series` and `DataFrame` are mutable in nature, while `Panel` is not.

1. **Series:** A `Series` is a one-dimensional array-like data structure and is mutable. You can change the values of individual elements in a Series after it has been created.

2. **DataFrame:** A `DataFrame` is a two-dimensional tabular data structure and is also mutable. You can modify the data in individual cells, add or remove columns, and perform various other data manipulation operations on a DataFrame.

3. **Panel:** However, the `Panel` data structure has been deprecated since pandas version 0.25.0 (July 2019) and is no longer recommended for use. It was a three-dimensional data structure for handling data, but its functionality has been integrated into the `MultiIndex` levels of DataFrames. `Panel` was not mutable like `Series` and `DataFrame`.

In modern versions of pandas, you will mostly work with `Series` and `DataFrame` for data manipulation and analysis. </p>

<h3 style='text-align: left;'> 7. Create a DataFrame using multiple Series. Explain with an example. </h3>

In [87]:
import pandas as pd

# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 28])
cities = pd.Series(['New York', 'London', 'San Francisco'])

# Creating a DataFrame using the Series
data = {'Name': names, 'Age': ages, 'City': cities}
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30         London
2  Charlie   28  San Francisco

<h4 style='text-align: right;'> Yash Sanjeev Halwai </h4>